app/Helpers/log_helper.php

function registrar_log(?int $id_usuario, string $accion, string $detalle = '', string $tipo_origen = 'usuario')
{
    $logModel = new LogUsuarioModel();

    $logModel->insert([
        'id_usuario'   => $id_usuario,
        'tipo_origen'  => $tipo_origen,
        'accion'       => $accion,
        'detalle'      => $detalle,
    ]);
---
INSERT INTO `log_usuario` (`id_usuario`, `tipo_origen`, `accion`, `detalle`, `fecha_hora`) VALUES (NULL, 'visitante', 'Consulta enviada', 'Tomas Fernandez (tomas10@gmail.com) envió una consulta. Mensaje: Buenas necesito bateria para practica escolar.Gracias...', '2025-06-24 16:27:21')