app/Cells/Notificaciones.php

   public function render(): string
{
    $logModel = new LogUsuarioModel();
    $logs = $logModel->orderBy('fecha_hora', 'DESC')->findAll(5, 0); // Limite 3, offset 0
---
SELECT *
FROM `log_usuario`
ORDER BY `fecha_hora` DESC
 LIMIT 5