app/Cells/Notificaciones.php

public function render(): string
{
    $limit = 5;
    $logModel = new LogUsuarioModel();
    $logs = $logModel
        ->select('log_usuario.*, usuarios.nombre')
        ->join('usuarios', 'usuarios.id_usuario = log_usuario.id_usuario', 'left')
        ->orderBy('fecha_hora', 'DESC')
        ->findAll($limit, 0); // Limita los primeros 5

    $total = $logModel->countAll();
---
SELECT `log_usuario`.*, `usuarios`.`nombre`
FROM `log_usuario`
LEFT JOIN `usuarios` ON `usuarios`.`id_usuario` = `log_usuario`.`id_usuario`
ORDER BY `fecha_hora` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows` FROM `log_usuario`