app/Controllers/compras_controller.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '4'
---
public function resumen_compras()
{
    helper(['form','url','cart']);

    $cart =\Config\Services::cart();

    $cartTotal=['cartTotal'=>count($cart->contents())] ; // Obtiene el total de productos

    $datos = [
        'cartTotal' => count($cart->contents()),
    ];
    $cart->contents();

    $session = session();
    $id_usuario = $session->get('id_usuario'); // Obtener el id del usuario logueado