app/Controllers/consulta_controller.php

INSERT INTO `consultas` (`nombre`, `email`, `mensaje`, `fecha_consulta`) VALUES ('Tomas Fernandez', 'tomas10@gmail.com', 'Buenas necesito bateria para practica escolar.Gracias', '2025-06-24 16:27:21')
---
            $data['id_usuario'] = $id_usuario;
        }

        $consultaModel->save($data);