app/Controllers/consulta_controller.php

    public function consultas()
    {
        helper(['form']);
        $consultaModel = new ConsultaModel();

        // Capturar fechas desde el formulario (GET)
        $fecha_desde = $this->request->getGet('fecha_desde');
        $fecha_hasta = $this->request->getGet('fecha_hasta');

        // Verificar si hay filtros de fecha
        if (!empty($fecha_desde) && !empty($fecha_hasta)) {
            $consultas = $consultaModel->where('fecha_consulta >=', $fecha_desde)
                                       ->where('fecha_consulta <=', $fecha_hasta)
                                       ->paginate(5);
        } elseif (!empty($fecha_desde)) {
            $consultas = $consultaModel->where('fecha_consulta >=', $fecha_desde)->paginate(5);
        } else {
            $consultas = $consultaModel->paginate(5);
---
SELECT *
FROM `consultas`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `consultas`

     public function ajaxLista()
    {
        helper(['form']);
        $consultaModel = new ConsultaModel();

        // Capturar fechas desde el formulario (GET)
        $fecha_desde = $this->request->getGet('fecha_desde');
        $fecha_hasta = $this->request->getGet('fecha_hasta');

        // Verificar si hay filtros de fecha
        if (!empty($fecha_desde) && !empty($fecha_hasta)) {
            $consultas = $consultaModel->where('fecha_consulta >=', $fecha_desde)
                                       ->where('fecha_consulta <=', $fecha_hasta)
                                       ->paginate(5);
        } elseif (!empty($fecha_desde)) {
            $consultas = $consultaModel->where('fecha_consulta >=', $fecha_desde)->paginate(5);
        } else {
            $consultas = $consultaModel->paginate(5);
---
SELECT *
FROM `consultas`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `consultas`

    public function consultas_respuestas()
{
    helper(['form']);
    $consultaModel = new ConsultaModel();

    // Capturar fechas desde el formulario (GET)
    $fecha_desde = $this->request->getGet('fecha_desde');
    $fecha_hasta = $this->request->getGet('fecha_hasta');

    // Verificar si hay filtros de fecha
    if (!empty($fecha_desde) && !empty($fecha_hasta)) {
        $consultas = $consultaModel->where('fecha_respuesta >=', $fecha_desde)
                                   ->where('fecha_respuesta <=', $fecha_hasta)
                                   ->paginate(5);
    } elseif (!empty($fecha_desde)) {
        $consultas = $consultaModel->where('fecha_respuesta >=', $fecha_desde)->paginate(5);
    } else {
        $consultas = $consultaModel->paginate(5);
---
SELECT *
FROM `consultas`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `consultas`

public function buscar()
{
    $consultaModel = new ConsultaModel();
    $search = $this->request->getPost('search');

    if ($search) {
        $resultados = $consultaModel
            ->orLike('id_consulta', $search)
            ->orLike('nombre', $search)
            ->orLike('email', $search)
            ->orLike('fecha_consulta', $search)
             ->paginate(5);
    } else {
        $resultados = $consultaModel->paginate(5);
---
SELECT *
FROM `consultas`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `consultas`