app/Controllers/login_controller.php

    private function refreshSessionData() {
        $idUsuario = session()->get('id_usuario'); // Accede a la sesión usando la función global
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '7'

    public function delete($id = 0) {
        $formModel = new UsersModel();
        $user = $formModel->where('id_usuario', $id)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '4'

 public function dashboard_cliente($id) {
        // Obtener el ID del usuario en sesión
        $id_usuario = session('id_usuario');

        // Cargar los modelos
        $userModel = new UsersModel();
        $personaModel = new PersonaModel();

        // Obtener los datos del usuario
        $usuario = $userModel->find($id_usuario);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '4'

$totalGastado = 0;

if (!empty($usuarioId)) {
    $queryTotal = $db->table('ventas_detalle vd')
        ->select('SUM(vd.cantidad * vd.precio) AS total_gastado')
        ->join('ventas_cabecera vh', 'vd.venta_id = vh.id')
        ->where('vh.usuario_id', $usuarioId)
        ->get();
---
SELECT SUM(vd.cantidad * vd.precio) AS total_gastado
FROM `ventas_detalle` `vd`
JOIN `ventas_cabecera` `vh` ON `vd`.`venta_id` = `vh`.`id`
WHERE `vh`.`usuario_id` = '4'