app/Controllers/PersonaController.php

SELECT *
FROM `domicilio`
WHERE `id_domicilio` = '6'
AND `id_usuario` = '7'
 LIMIT 1
---
public function actualizarDatos($id)
{
    // Iniciar sesión
    $session = session();

    // Verificar si hay un usuario en sesión
    if (!$session->has('id_usuario')) {
        return redirect()->to('/login')->with('error', 'Debes iniciar sesión primero.');
    }

    // Obtener el id_usuario de la sesión
    $id_usuario = $session->get('id_usuario');

    // Cargar el modelo
    $personaModel = new PersonaModel();

    // Verificar si el registro existe y pertenece al usuario en sesión
    $persona = $personaModel->where('id_domicilio', $id)->where('id_usuario', $id_usuario)->first();