app/Controllers/producto_controller.php

    public function index()
    {
        helper(['form']);
        $productoModel = new productosModel();

        // Capturar las fechas desde el formulario (GET)
        $fecha_desde = $this->request->getGet('fecha_desde');
        $fecha_hasta = $this->request->getGet('fecha_hasta');

        // Aplicar el filtro según las fechas ingresadas
        if (!empty($fecha_desde) && !empty($fecha_hasta)) {
            $productos = $productoModel->obtenerProductosPorRangoFechas($fecha_desde, $fecha_hasta);
        } elseif (!empty($fecha_desde)) {
            $productos = $productoModel->obtenerProductosPorFechaDesde($fecha_desde);
        } else {
            $productos = $productoModel->paginate(5);
---
SELECT *
FROM `productos`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `productos`