app/Controllers/VentasController.php

  public function factura($venta_id)
     {
         $detalleModel = new VentasModel();
         $ventaCabeceraModel = new VentasHeadModel();
         $productModel = new productosModel();
         $userModel = new UsersModel();
         $personaModel = new PersonaModel(); // Cargar el modelo de Persona

         // Obtener detalles de la venta
         $detalles = $detalleModel->getDetalles($venta_id);

         // Obtener información de la cabecera de la venta
         $ventaCabecera = $ventaCabeceraModel->find($venta_id);

         // Obtener nombres de los productos
         $productos = [];
         foreach ($detalles as $detalle) {
             $producto = $productModel->find($detalle['idProducto']);
             $productos[$detalle['idProducto']] = $producto['nombre_producto'];
         }

         // Obtener nombre del comprador
         $comprador = $userModel->find($ventaCabecera['usuario_id']);
          // Obtener datos de la persona
         $persona = $personaModel->where('id_usuario', $ventaCabecera['usuario_id'])->first();
---
SELECT *
FROM `productos`
WHERE `productos`.`idProducto` = '10'
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '7'