app/Models/CategoriaModel.php

    public function getCategorias(){
        return $this->findAll();
---
SELECT *
FROM `categoria`