app/Models/ConsultaModel.php

public function obtenerConsultasConUsuarioPaginadas($porPagina = 10)
{
    return $this->select('consultas.*, usuarios.nombre AS nombre_usuario, usuarios.apellido AS apellido_usuario, usuarios.email AS email_usuario, usuarios.id_perfil, perfil.descripcion AS perfil')
        ->join('usuarios', 'usuarios.id_usuario = consultas.id_usuario', 'left')
        ->join('perfil', 'perfil.id_perfil = usuarios.id_perfil', 'left')
       ->orderBy('consultas.id_consulta', 'DESC')// asegura el orden
        ->paginate($porPagina);
---
SELECT COUNT(*) AS `numrows`
FROM `consultas`
LEFT JOIN `usuarios` ON `usuarios`.`id_usuario` = `consultas`.`id_usuario`
LEFT JOIN `perfil` ON `perfil`.`id_perfil` = `usuarios`.`id_perfil`
SELECT `consultas`.*, `usuarios`.`nombre` AS `nombre_usuario`, `usuarios`.`apellido` AS `apellido_usuario`, `usuarios`.`email` AS `email_usuario`, `usuarios`.`id_perfil`, `perfil`.`descripcion` AS `perfil`
FROM `consultas`
LEFT JOIN `usuarios` ON `usuarios`.`id_usuario` = `consultas`.`id_usuario`
LEFT JOIN `perfil` ON `perfil`.`id_perfil` = `usuarios`.`id_perfil`
ORDER BY `consultas`.`id_consulta` DESC
 LIMIT 10