app/Models/productosModel.php

SELECT `productos`.*, `categoria`.`descripcion` AS `cate`
FROM `productos`
JOIN `categoria` ON `productos`.`id_categoria` = `categoria`.`id_categoria`
---
    public function categorias(){
       return $this->select('productos.*, categoria.descripcion AS cate' )
        ->join('categoria', 'productos.id_categoria = categoria.id_categoria')->findAll();