app/Models/VentasModel.php

SELECT `productos`.`nombre_producto`, `productos`.`imagen`, SUM(ventas_detalle.cantidad) as total_vendido
FROM `ventas_detalle`
JOIN `productos` ON `productos`.`idProducto` = `ventas_detalle`.`producto_id`
GROUP BY `ventas_detalle`.`producto_id`
ORDER BY `total_vendido` DESC
---
    public function obtenerTopProductos()
    {

        return $this->select('productos.nombre_producto,productos.imagen, SUM(ventas_detalle.cantidad) as total_vendido')
                    ->join('productos', 'productos.idProducto = ventas_detalle.producto_id')
                    ->groupBy('ventas_detalle.producto_id')
                    ->orderBy('total_vendido', 'DESC')
                    ->limit(3)
                    ->findAll();

SELECT `ventas_detalle`.*, `productos`.`nombre_producto` AS `nombre_producto`
FROM `ventas_detalle`
JOIN `productos` ON `productos`.`idProducto` = `ventas_detalle`.`producto_id`
WHERE `venta_id` = '61'
---
    public function obtenerDetallesPedido($idPedido)
    {
        return $this->select('ventas_detalle.*, productos.nombre_producto AS nombre_producto')
            ->join('productos', 'productos.idProducto = ventas_detalle.producto_id')
            ->where('venta_id', $idPedido)
            ->findAll();